stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_adc.c
    /* Configuration of ADC:                                                  */
    /*  - Sample Rate                              Init.SampleRate            */
    /*  - Sample Rate MSB                          Init.SampleRateMsb         */
    /*  - Sampling Mode                            Init.SamplingMode          */
    /*  - Overrun Mode                             Init.Overrun               */
    /*  - Invert Output Bit Mode                   Init.InvertOutputMode      */
    /*  - Conversion Type                          Init.ConversionType        */

    /* Configure the sample rate */
    LL_ADC_SetSampleRate(hadc->Instance, hadc->Init.SampleRate);

    /* Configure the input sampling mode */
    LL_ADC_SetInputSamplingMode(hadc->Instance, hadc->Init.SamplingMode);

    /* Configure the continuous mode */
    if (hadc->Init.ContinuousConvMode == ENABLE)
    {
      LL_ADC_ContinuousModeEnable(hadc->Instance);
    }
    else
    {
      LL_ADC_ContinuousModeDisable(hadc->Instance);
    }


    /* Configure the overrun mode for the output data */
#if defined(ADC_SUPPORT_AUDIO_FEATURES)
    if (hadc->Init.ConversionType == ADC_CONVERSION_WITH_DS)
    {
      LL_ADC_SetOverrunDS(hadc->Instance, hadc->Init.Overrun);
    }
    else
    {
      LL_ADC_SetOverrunDF(hadc->Instance, hadc->Init.Overrun);
    }
#else
    LL_ADC_SetOverrunDS(hadc->Instance, hadc->Init.Overrun);
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

    /* Configure the bit to bit inversion (1' complement) mode */
    if (hadc->Init.InvertOutputMode == ADC_DATA_INVERT_NONE)
    {
      LL_ADC_InvertOutputDiffModeDisable(hadc->Instance);
      LL_ADC_InvertOutputSingleNegModeDisable(hadc->Instance);
    }
    else if (hadc->Init.InvertOutputMode == ADC_DATA_INVERT_DIFF)
    {
      LL_ADC_InvertOutputDiffModeEnable(hadc->Instance);
      LL_ADC_InvertOutputSingleNegModeDisable(hadc->Instance);
    }
    else if (hadc->Init.InvertOutputMode == ADC_DATA_INVERT_SING)
    {
      LL_ADC_InvertOutputDiffModeDisable(hadc->Instance);
      LL_ADC_InvertOutputSingleNegModeEnable(hadc->Instance);
    }
    else
    {
      LL_ADC_InvertOutputDiffModeEnable(hadc->Instance);
      LL_ADC_InvertOutputSingleNegModeEnable(hadc->Instance);
    }

    LL_ADC_ConfigureDSDataOutput(hadc->Instance, hadc->Init.DownSamplerConfig.DataWidth,
                                 hadc->Init.DownSamplerConfig.DataRatio);

    LL_ADC_SetSequenceLength(hadc->Instance, hadc->Init.SequenceLength);

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
    /* Configure the overrun mode for the output data */
    if (hadc->Init.ConversionType == ADC_CONVERSION_WITH_DS)
    {
      /* Configure the operation mode as ADC mode (static/low frequency signal) through the Down Sampler (DS) */
      LL_ADC_SetADCMode(hadc->Instance, LL_ADC_OP_MODE_ADC);
    }
    else
    {
      /* Configure the operation mode as Full ADC mode through the Decimation Filter (DF) */
      LL_ADC_SetADCMode(hadc->Instance, LL_ADC_OP_MODE_FULL);
    }
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

    /* Initialize the ADC state */
    /* Clear HAL_ADC_STATE_BUSY_INTERNAL bit, set HAL_ADC_STATE_READY bit */
    ADC_STATE_CLR_SET(hadc->State, HAL_ADC_STATE_BUSY_INTERNAL, HAL_ADC_STATE_READY);
  }
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

    tmp_hal_status = HAL_ERROR;
  }

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Deinitialize the ADC peripheral registers to their default reset
  *         values, with deinitialization of the ADC MSP.
  * @param hadc ADC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_DeInit(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status;

  /* Check ADC handle */
  if (hadc == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Set ADC state */
  SET_BIT(hadc->State, HAL_ADC_STATE_BUSY_INTERNAL);

  /* Stop potential conversion on going */
  tmp_hal_status = ADC_ConversionStop(hadc);

  /* Disable ADC peripheral if conversions are effectively stopped */
  if (tmp_hal_status == HAL_OK)
  {
    /* Disable the ADC peripheral */
    tmp_hal_status = ADC_Disable(hadc);

    /* Check if ADC is effectively disabled */
    if (tmp_hal_status == HAL_OK)
    {
      /* Change ADC state */
      hadc->State = HAL_ADC_STATE_READY;
    }
  }

  /* Note: HAL ADC deInit is done independently of ADC conversion stop        */
  /*       and disable return status. In case of status fail, attempt to      */
  /*       perform deinitialization anyway and it is up user code in          */
  /*       in HAL_ADC_MspDeInit() to reset the ADC peripheral using           */
  /*       system RCC hard reset.                                             */

  /* ========== Reset ADC registers ========== */
#if defined(ADC_IRQ_EN_MASK)
  /* Reset register IER */
  __HAL_ADC_DISABLE_IT(hadc, ADC_IRQ_EN_MASK);
#endif /* ADC_IRQ_EN_MASK */
#if defined(ADC_IRQ_FLAGS_MASK)
  /* Reset register ISR */
  __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAGS_MASK);
#endif /* ADC_IRQ_FLAGS_MASK */

  /* Reset all the registers */
  CLEAR_BIT(hadc->Instance->CONF, (ADC_CONF_BIT_INVERT_DIFF
#if defined(ADC_CONF_SAMPLE_RATE_MSB)
                                   | ADC_CONF_SAMPLE_RATE_MSB
#endif /* ADC_CONF_SAMPLE_RATE_MSB */
                                   | ADC_CONF_OVR_DS_CFG | ADC_CONF_DMA_DS_ENA
                                   | ADC_CONF_SAMPLE_RATE
                                   | ADC_CONF_SMPS_SYNCHRO_ENA
                                   | ADC_CONF_SEQ_LEN
                                   | ADC_CONF_CONT
#if defined(ADC_SUPPORT_AUDIO_FEATURES)
                                   | ADC_CONF_VBIAS_PRECH_FORCE
                                   | ADC_CONF_OVR_DF_CFG | ADC_CONF_DMA_DF_ENA
                                   | ADC_CONF_OP_MODE
#endif /* ADC_SUPPORT_AUDIO_FEATURES */
                                  ));

  SET_BIT(hadc->Instance->CONF, (ADC_CONF_ADC_CONT_1V2 | ADC_CONF_BIT_INVERT_SN | ADC_CONF_SEQUENCE));

  CLEAR_BIT(hadc->Instance->CTRL, (ADC_CTRL_ADC_LDO_ENA
#if defined(ADC_SUPPORT_AUDIO_FEATURES)
                                   | ADC_CTRL_DIG_AUD_MODE
#endif /* ADC_SUPPORT_AUDIO_FEATURES */
                                   | ADC_CTRL_STOP_OP_MODE | ADC_CTRL_START_CONV
                                   | ADC_CTRL_ADC_ON_OFF));

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
  CLEAR_BIT(hadc->Instance->OCM_CTRL, (ADC_OCM_CTRL_OCM_ENA | ADC_OCM_CTRL_OCM_SRC));

  CLEAR_BIT(hadc->Instance->PGA_CONF, (ADC_PGA_CONF_PGA_BIAS | ADC_PGA_CONF_PGA_GAIN));
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

  CLEAR_BIT(hadc->Instance->SWITCH, (ADC_SWITCH_SE_VIN_7 | ADC_SWITCH_SE_VIN_6
                                     | ADC_SWITCH_SE_VIN_5 | ADC_SWITCH_SE_VIN_4
                                     | ADC_SWITCH_SE_VIN_3 | ADC_SWITCH_SE_VIN_2
                                     | ADC_SWITCH_SE_VIN_1 | ADC_SWITCH_SE_VIN_0));

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
  CLEAR_BIT(hadc->Instance->DF_CONF, (ADC_DF_CONF_DF_HALF_D_EN
                                      | ADC_DF_CONF_DF_HPF_EN | ADC_DF_CONF_DF_MICROL_RN
                                      | ADC_DF_CONF_PDM_RATE
                                      | ADC_DF_CONF_DF_O_S2U
                                      | ADC_DF_CONF_DF_I_U2S  | ADC_DF_CONF_DF_ITP1P2
                                      | ADC_DF_CONF_DF_CIC_DHF | ADC_DF_CONF_DF_CIC_DEC_FACTOR));

  SET_BIT(hadc->Instance->DF_CONF, (ADC_DF_CONF_PDM_RATE_1 | ADC_DF_CONF_PDM_RATE_2));
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

  CLEAR_BIT(hadc->Instance->DS_CONF, (ADC_DS_CONF_DS_WIDTH | ADC_DS_CONF_DS_RATIO));

  CLEAR_BIT(hadc->Instance->SEQ_1, (ADC_SEQ_1_SEQ7 | ADC_SEQ_1_SEQ6
                                    | ADC_SEQ_1_SEQ5 | ADC_SEQ_1_SEQ4
                                    | ADC_SEQ_1_SEQ3 | ADC_SEQ_1_SEQ2
                                    | ADC_SEQ_1_SEQ1 | ADC_SEQ_1_SEQ0));

  CLEAR_BIT(hadc->Instance->SEQ_2, (ADC_SEQ_2_SEQ15 | ADC_SEQ_2_SEQ14
                                    | ADC_SEQ_2_SEQ13 | ADC_SEQ_2_SEQ12
                                    | ADC_SEQ_2_SEQ11 | ADC_SEQ_2_SEQ10
                                    | ADC_SEQ_2_SEQ9  | ADC_SEQ_2_SEQ8));

  MODIFY_REG(hadc->Instance->COMP_1, (ADC_COMP_1_OFFSET1 | ADC_COMP_1_GAIN1), 0x555UL);
  MODIFY_REG(hadc->Instance->COMP_2, (ADC_COMP_1_OFFSET1 | ADC_COMP_1_GAIN1), 0x555UL);
  MODIFY_REG(hadc->Instance->COMP_3, (ADC_COMP_1_OFFSET1 | ADC_COMP_1_GAIN1), 0x555UL);
  MODIFY_REG(hadc->Instance->COMP_4, (ADC_COMP_1_OFFSET1 | ADC_COMP_1_GAIN1), 0x555UL);

  CLEAR_BIT(hadc->Instance->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN8 | ADC_COMP_SEL_OFFSET_GAIN7
                                       | ADC_COMP_SEL_OFFSET_GAIN6 | ADC_COMP_SEL_OFFSET_GAIN5
                                       | ADC_COMP_SEL_OFFSET_GAIN4 | ADC_COMP_SEL_OFFSET_GAIN3
                                       | ADC_COMP_SEL_OFFSET_GAIN2 | ADC_COMP_SEL_OFFSET_GAIN1
                                       | ADC_COMP_SEL_OFFSET_GAIN0));

  MODIFY_REG(hadc->Instance->WD_TH, (ADC_WD_TH_WD_HT | ADC_WD_TH_WD_LT), ADC_WD_TH_WD_HT);

  CLEAR_BIT(hadc->Instance->WD_CONF, (ADC_WD_CONF_AWD_CHX));

