stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_adc.c
    /* Check sequence of conversion completed flag */
    case ADC_IRQ_FLAG_EOS:
      /* Set ADC state */
      SET_BIT(hadc->State, HAL_ADC_STATE_DS_EOC);

      /* Clear ADC sequence of conversion completed flag */
      __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_EOS);

      break;

    /* Check Down Sampler conversion completed flag */
    case ADC_IRQ_FLAG_EODS:
      /* Set ADC state */
      SET_BIT(hadc->State, HAL_ADC_STATE_DS_EOC);

      /* Clear ADC Down Sampler conversion completed flag */
      __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_EODS);

      break;

    /* Overrun event */
    default: /* Case ADC_OVR_EVENT */
      /* If overrun is set to overwrite previous data, overrun event is not     */
      /* considered as an error.                                                */
      if (hadc->Init.Overrun == ADC_NEW_DATA_IS_LOST)
      {
        /* Set ADC state */
        SET_BIT(hadc->State, HAL_ADC_STATE_DS_OVR);

        /* Set ADC error code to overrun */
        SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_OVR);
      }
      else
      {
        /* Clear ADC Overrun flag only if Overrun is set to ADC_NEW_DATA_IS_KEPT
          otherwise, data register is potentially overwritten by new converted data as soon
          as OVR is cleared. */
        __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_OVRDS);
      }
      break;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Enable ADC and start conversion with interruption.
  * @note   Interruptions enabled in this function according to initialization
  *         setting : EOC (end of conversion), EOS (end of sequence),
  *         OVR overrun.
  *         Each of these interruptions has its dedicated callback function.
  * @note   To guarantee a proper reset of all interruptions once all the needed
  *         conversions are obtained, HAL_ADC_Stop_IT() must be called to ensure
  *         a correct stop of the IT-based conversions.
  * @param hadc ADC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_Start_IT(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  /* Enable the ADC peripheral */
  tmp_hal_status = ADC_Enable(hadc);

  /* Start conversion if ADC is effectively enabled */
  if (tmp_hal_status == HAL_OK)
  {
    /* Set ADC state                                                        */
    /* - Clear state bitfield related to conversion results   */
    /* - Set state bitfield related to operation                    */
    ADC_STATE_CLR_SET(hadc->State,
                      HAL_ADC_STATE_READY | HAL_ADC_STATE_DS_EOC | HAL_ADC_STATE_DS_OVR,
                      HAL_ADC_STATE_DS_BUSY);

    /* Reset all ADC error code fields */
    ADC_CLEAR_ERRORCODE(hadc);

    /* Clear ADC conversion flag and overrun flag               */
    /* (To ensure of no unknown state from potential previous ADC operations) */
    __HAL_ADC_CLEAR_FLAG(hadc, (ADC_IRQ_FLAG_EODS | ADC_IRQ_FLAG_EOS | ADC_IRQ_FLAG_OVRDS));

    /* Process unlocked */
    /* Unlock before starting ADC conversions: in case of potential         */
    /* interruption, to let the process to ADC IRQ Handler.                 */
    __HAL_UNLOCK(hadc);

    /* Disable all interruptions before enabling the desired ones */
    __HAL_ADC_DISABLE_IT(hadc, (ADC_IRQ_EN_EODS | ADC_IRQ_EN_EOS | ADC_IRQ_EN_OVRDS));

    /* Enable ADC end of conversion interrupt */
    __HAL_ADC_ENABLE_IT(hadc, ADC_IRQ_EN_EOS);

    /* Enable ADC overrun interrupt */
    /* If hadc->Init.Overrun is set to ADC_NEW_DATA_IS_LOST, only then is */
    /* ADC_IRQ_EN_OVRDS enabled; otherwise data overwrite is considered as  */
    /* normal behavior and no CPU time is lost for a non-processed          */
    /* interruption.                                                        */
    if (hadc->Init.Overrun == ADC_NEW_DATA_IS_LOST)
    {
      __HAL_ADC_ENABLE_IT(hadc, ADC_IRQ_EN_OVRDS);
    }

    /* Enable conversion.                                                   */
    /* If software start has been selected, conversion starts immediately.  */
    /* If external trigger has been selected, conversion will start at next */
    /* trigger event.                                                       */
    /* Start ADC conversion */
    LL_ADC_StartConversion(hadc->Instance);

  }
  else
  {
    tmp_hal_status = HAL_BUSY;
  }

  /* Return function status */
  return tmp_hal_status;
}


/**
  * @brief  Stop ADC conversion, disable interrution of
  *         end-of-conversion, disable ADC peripheral.
  * @param hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_ADC_Stop_IT(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  /* 1. Stop potential conversion on going*/
  tmp_hal_status = ADC_ConversionStop(hadc);

  /* Disable ADC peripheral if conversions are effectively stopped */
  if (tmp_hal_status == HAL_OK)
  {
    /* Disable ADC end of conversion interrupt */
    /* Disable ADC overrun interrupt */
    __HAL_ADC_DISABLE_IT(hadc, (ADC_IRQ_EN_EODS | ADC_IRQ_EN_EOS | ADC_IRQ_EN_OVRDS));

    /* 2. Disable the ADC peripheral */
    tmp_hal_status = ADC_Disable(hadc);

    /* Check if ADC is effectively disabled */
    if (tmp_hal_status == HAL_OK)
    {
      /* Set ADC state */
      ADC_STATE_CLR_SET(hadc->State, HAL_ADC_STATE_DS_BUSY, HAL_ADC_STATE_READY);
    }
  }

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}


/**
  * @brief  Enable ADC, start conversion and transfer result through DMA.
  * @note   Interruptions enabled in this function:
  *         overrun (if applicable), DMA half transfer, DMA transfer complete.
  *         Each of these interruptions has its dedicated callback function.
  *         The ADC continuous mode is enabled in this DMA acquisition mode.
  * @param hadc ADC handle
  * @param pData Destination Buffer address.
  * @param Length Number of data to be transferred from ADC peripheral to memory
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_ADC_Start_DMA(ADC_HandleTypeDef *hadc, const uint32_t *pData, uint32_t Length)
{
  HAL_StatusTypeDef tmp_hal_status;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  /* Enable the ADC peripheral */
  tmp_hal_status = ADC_Enable(hadc);

  /* Start conversion if ADC is effectively enabled */
  if (tmp_hal_status == HAL_OK)
  {
    /* Set ADC state                                                      */
    /* - Clear state bitfield related to conversion results               */
    /* - Set state bitfield related to operation                          */
    ADC_STATE_CLR_SET(hadc->State,
                      HAL_ADC_STATE_READY | HAL_ADC_STATE_DS_EOC | HAL_ADC_STATE_DS_OVR,
                      HAL_ADC_STATE_DS_BUSY);

    /* Reset all ADC error code fields */
    ADC_CLEAR_ERRORCODE(hadc);

    /* Set the DMA transfer complete callback */
    hadc->DMA_Handle->XferCpltCallback = ADC_DMAConvCplt;

