stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_adc.c
    /* Set the DMA half transfer complete callback */
    hadc->DMA_Handle->XferHalfCpltCallback = ADC_DMAHalfConvCplt;

    /* Set the DMA error callback */
    hadc->DMA_Handle->XferErrorCallback = ADC_DMAError;

    /* Manage ADC and DMA start: ADC overrun interruption, DMA start,     */
    /* ADC start (in case of SW start):                                   */

    /* Clear conversion flag and overrun flag                             */
    /* (To ensure of no unknown state from potential previous ADC         */
    /* operations)                                                        */
    __HAL_ADC_CLEAR_FLAG(hadc, (ADC_IRQ_FLAG_EODS | ADC_IRQ_FLAG_EOS | ADC_IRQ_FLAG_OVRDS));

    /* Process unlocked */
    /* Unlock before starting ADC conversions: in case of potential       */
    /* interruption, to let the process to ADC IRQ Handler.               */
    __HAL_UNLOCK(hadc);

    /* With DMA, overrun event is always considered as an error even if
        hadc->Init. Overrun is set to ADC_NEW_DATA_IS_KEPT. Therefore,
        ADC_IRQ_EN_OVRDS is enabled. */
    __HAL_ADC_ENABLE_IT(hadc, ADC_IRQ_EN_OVRDS);

    /* Enable ADC DMA mode */
    LL_ADC_DMAModeDSEnable(hadc->Instance);

    /* Start the DMA channel */
    tmp_hal_status = HAL_DMA_Start_IT(hadc->DMA_Handle, (uint32_t)&hadc->Instance->DS_DATAOUT, (uint32_t)pData,
                                      Length);

    if (tmp_hal_status != HAL_ERROR)
    {
      /* Enable conversion.                                                   */
      /* If software start has been selected, conversion starts immediately.  */
      /* If external trigger has been selected, conversion will start at next */
      /* trigger event.                                                       */
      /* Start ADC group conversion */
      LL_ADC_StartConversion(hadc->Instance);
    }
  }
  else
  {
    /* Process unlocked */
    __HAL_UNLOCK(hadc);
  }

  /* Return function status */
  return tmp_hal_status;
}


/**
  * @brief  Stop ADC conversion, disable ADC DMA transfer, disable
  *         ADC peripheral.
  * @param hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_ADC_Stop_DMA(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  /* 1. Stop potential ADC conversion on going */
  LL_ADC_ContinuousModeDisable(hadc->Instance);
  tmp_hal_status = ADC_ConversionStop(hadc);

  /* Disable ADC peripheral if conversions are effectively stopped */
  if (tmp_hal_status == HAL_OK)
  {

    /* Abort the ADC DMA channel */
    if (hadc->DMA_Handle != NULL)
    {
      /* Disable ADC DMA (ADC DMA configuration of continuous requests is kept) */
      LL_ADC_DMAModeDSDisable(hadc->Instance);

      if (HAL_DMA_Abort_IT(hadc->DMA_Handle) != HAL_OK)
      {
        if (HAL_DMA_GetError(hadc->DMA_Handle) == HAL_DMA_ERROR_TIMEOUT)
        {
          /* Set error code to DMA */
          hadc->ErrorCode = HAL_ADC_ERROR_DMA;

          /* Process Unlocked */
          __HAL_UNLOCK(hadc);

          return HAL_TIMEOUT;
        }
      }
    }

    /* Disable the DMA channel (in case of DMA in circular mode or stop       */
    /* while DMA transfer is on going)                                        */
    if (hadc->DMA_Handle->State == HAL_DMA_STATE_BUSY)
    {
      tmp_hal_status = HAL_DMA_Abort(hadc->DMA_Handle);

      /* Check if DMA channel effectively disabled */
      if (tmp_hal_status != HAL_OK)
      {
        /* Update ADC state machine to error */
        SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_DMA);
      }
    }

    /* Disable ADC overrun interrupt */
    __HAL_ADC_DISABLE_IT(hadc, ADC_IRQ_EN_OVRDS);

    /* 2. Disable the ADC peripheral */
    /* Update "tmp_hal_status" only if DMA channel disabling passed,          */
    /* to keep in memory a potential failing status.                          */
    if (tmp_hal_status == HAL_OK)
    {
      tmp_hal_status = ADC_Disable(hadc);
    }
    else
    {
      (void)ADC_Disable(hadc);
    }

    /* Check if ADC is effectively disabled */
    if (tmp_hal_status == HAL_OK)
    {
      /* Set ADC state */
      ADC_STATE_CLR_SET(hadc->State, HAL_ADC_STATE_DS_BUSY, HAL_ADC_STATE_READY);
    }

  }

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Get ADC conversion result (raw value).
  * @note   Occurrence of flag EOS rising:
  *          - If sequencer is composed of 1 rank, flag EOS is equivalent
  *            to flag EOC.
  *          - If sequencer is composed of several ranks, during the scan
  *            sequence flag EOC only is raised, at the end of the scan sequence
  *            both flags EOC and EOS are raised.
  *         The flag EODS is rising when the Down Sampler conversion is
  *         completed.
  *         To clear those flags, either use function:
  *         in programming model IT: @ref HAL_ADC_IRQHandler(), in programming
  *         model polling: @ref HAL_ADC_PollForConversion()
  *         or @ref __HAL_ADC_CLEAR_FLAG(&hadc, ADC_IRQ_FLAG_EOS).
  * @param hadc ADC handle
  * @retval ADC conversion data
  */
uint32_t HAL_ADC_GetValue(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Return ADC converted value */
  return LL_ADC_DSGetOutputData(hadc->Instance);
}

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/**
  * @brief  Get ADC conversion result from decimation filter(raw value).
  * @note   Flag EODF is rising when decimation filter conversion is
  *         completed.
  *         To clear this flag, either use function:
  *         in programming model IT: @ref HAL_ADC_IRQHandler(), in programming
  *         model polling: @ref HAL_ADC_PollForConversion()
  *         or @ref __HAL_ADC_CLEAR_FLAG(&hadc, ADC_IRQ_FLAG_EOS).
  * @param hadc ADC handle
  * @retval ADC conversion data
  */
uint32_t HAL_ADC_GetValue_DF(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

