stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_adc.c
  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Configure the PDM clock rate.
  *         The PDM clock rate is : SYSTEM_CLOCK / (Divider).
  * @param hadc ADC handle
  * @param ConfigPDM Structure of PDM Interface configuration
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_PDMConfig(ADC_HandleTypeDef *hadc, const ADC_PDMConfTypeDef *ConfigPDM)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_PDM_CLOCK_DIVIDER(ConfigPDM->ClockDivider));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_SetPDMRate(hadc->Instance, ConfigPDM->ClockDivider);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief Enable the digital audio mode.
  * @param hadc ADC handle
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_PDMStart(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_AudioModeEnable(hadc->Instance);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Disable the digital audio mode.
  * @param hadc ADC handle
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_PDMStop(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_AudioModeDisable(hadc->Instance);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief Configure PGA used in the ADC analog microphone mode.
  * @note The PGA voltage bias value is expressed as a ratio of the battery
  *       voltage VBAT, between 0.5 and 0.9.
  * @note The PGA gain value is expressed in DB
  * @param hadc ADC handle
  * @param ConfigPGA Structure of PGA parameters.
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_PGAConfig(ADC_HandleTypeDef *hadc, const ADC_PGAConfTypeDef *ConfigPGA)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_PGA_BIAS(ConfigPGA->Bias));
  assert_param(IS_ADC_PGA_GAIN(ConfigPGA->Gain));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_ConfigureMicrophonePGA(hadc->Instance, ConfigPGA->Bias, ConfigPGA->Gain);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}
/**
  * @}
  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/** @defgroup ADC_Exported_Functions_Group5 Occasional Mode Control functions
  * @brief Configure and start occasional mode
  *
@verbatim
 ===============================================================================
             ##### Occasional Mode Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure the channel converted in occasional mode
      (+) Start an occasional conversion

@endverbatim
  * @{
  */

/**
  * @brief  Set the ADC occasional conversion source.
  * @param hadc ADC handle
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref ADC_OCM_SRC_VBAT
  *         @arg @ref ADC_OCM_SRC_TEMP
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_SetOccasionalSource(ADC_HandleTypeDef *hadc, uint32_t Source)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_OCM_SOURCE(Source));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_SetOccasionalConversionSource(hadc->Instance, Source);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief Start an ADC occasional conversion during an analog audio conversion
  *        or during an ADC full mode.
  * @param hadc ADC handle
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_StartOccasionalMode(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_StartOccasionalConversionMode(hadc->Instance);

  /* Process locked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @}
  */
#endif /* ADC_SUPPORT_AUDIO_FEATURES */

/** @defgroup ADC_Exported_Functions_Group6 Analog Timing Control functions
  * @brief Configure analog related timing parameters
@verbatim
 ===============================================================================
             ##### Analog Timing Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure the synchronisation between SMPS and ADC start of conversion
      (+) Configure the ADC PGA VBias precharge duration
      (+) Configure the ADC LDO delay

@endverbatim
  * @{
  */

/**
  * @brief  Enable the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS.
  * @note   The synchronization should only be enabled when using the SMPS with
  *         an ADC clock different from 32 MHz.
  * @param hadc ADC handle
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_SMPSSyncEnable(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_SMPSSyncEnable(hadc->Instance);

  /* Process locked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @brief  Disable the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS.
  * @note   The synchronization should only be enabled when using the SMPS with
  *         an ADC clock different from 32 MHz.
  * @param hadc ADC handle
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_SMPSSyncDisable(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_SMPSSyncDisable(hadc->Instance);

  /* Process locked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/**
  * @brief Configure the Vbias precharge time of the Programmable Gain Amplifier.
  * @note The delay in microseconds corresponding to the duration of a waiting
  *       time starting at rising edge of PGA_EN signal. This duration is the
  *       VBIAS precharge pulse duration.
  * @note The delay value should be an increment of 4us between 0us and 1020.
  *       Then the value should be an increment of 4096us between 4096us and
  *       1044480us. If these requirements are not met the function configure
  *       an approximate available value close to the input value.
  * @note This value is configured at reset to a default value. This value can be
  *       reconfigured using @arg @ref ADC_DEFAULT_VBIAS_PRECH_DELAY_US.
  * @param hadc ADC handle
  * @param Delay_us delay in us. This parameter must be a number between
  *                 Min_Data = 4 and Max_Data = 1'044'480.
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_VBiasPrechargeDelayConfig(ADC_HandleTypeDef *hadc, uint32_t Delay_us)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_PGA_VBIAS_PRECHARGE_DELAY(Delay_us));

  /* Process locked */
  __HAL_LOCK(hadc);

  if (Delay_us <= ADC_VBIAS_PRECH_DELAY_PRESC_MAX_VALUE)
  {
    LL_ADC_VbiasPrechargeDelayPrescalerDisable(hadc->Instance);
    LL_ADC_SetVbiasPrechargeDelay(hadc->Instance, (Delay_us) / (4UL));
  }
  else
  {
    LL_ADC_VbiasPrechargeDelayPrescalerEnable(hadc->Instance);
    LL_ADC_SetVbiasPrechargeDelay(hadc->Instance, (Delay_us) / (4096UL));
  }

