stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_adc.c
  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

#endif /* ADC_SUPPORT_AUDIO_FEATURES */
/**
  * @brief Configure the LDO stabilization time
  * @note The delay in microseconds corresponding to the duration of a waiting
  *       time to be inserted between the ADC_LDO enable and the ADC ON to let
  *       the LDO stabilize before starting a conversion.
  * @note The delay value should be an increment of 4us. Otherwise the function
  *       configure an approximate available value close to the input value.
  * @note This value is configured at reset to a default value. This value can be
  *       reconfigured using @arg @ref ADC_DEFAULT_LDO_DELAY_US.
  * @param hadc ADC handle
  * @param Delay_us delay in us. This parameter must be a number between
  *                 Min_Data = 4 and Max_Data = 1020.
  * @return HAL status
  */
HAL_StatusTypeDef HAL_ADC_LDODelayConfig(ADC_HandleTypeDef *hadc, uint32_t Delay_us)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_LDO_DELAY(Delay_us));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_SetADCLDODelay(hadc->Instance, (Delay_us) / 0xFFUL);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}
/**
  * @}
  */


/** @defgroup ADC_Exported_Functions_Group3 Peripheral Control functions
  * @brief    Peripheral Control functions
  *
@verbatim
 ===============================================================================
             ##### Peripheral Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure channels on a conversion sequence
      (+) Configure the analog watchdog

@endverbatim
  * @{
  */

/**
  * @brief Configure a channel to be assigned to ADC conversion sequence.
  * @param hadc ADC handle
  * @param sConfigChannel Structure of ADC channel configuration and position in
  *                       ADC conversion sequence.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_ConfigChannel(ADC_HandleTypeDef *hadc, const ADC_ChannelConfTypeDef *sConfigChannel)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;
  uint32_t tmp_gain;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_RANK(sConfigChannel->Rank));
  assert_param(IS_ADC_VOLTAGE_RANGE(sConfigChannel->VoltRange));
  assert_param(IS_ADC_CHANNEL(sConfigChannel->Channel));

  assert_param(IS_ADC_CALIBRATION_POINT(sConfigChannel->CalibrationPoint.Number));
  assert_param(IS_ADC_CALIBRATION_GAIN(sConfigChannel->CalibrationPoint.Gain));
  assert_param(IS_ADC_CALIBRATION_OFFSET(sConfigChannel->CalibrationPoint.Offset));

  /* Process locked */
  __HAL_LOCK(hadc);

  if (LL_ADC_IsConversionOngoing(hadc->Instance) == 0UL)
  {
    LL_ADC_SetSequencerRanks(hadc->Instance, sConfigChannel->Rank, sConfigChannel->Channel);
    if ((sConfigChannel->Channel != ADC_CHANNEL_TEMPSENSOR)
        && (sConfigChannel->Channel != ADC_CHANNEL_VBAT))
    {
      LL_ADC_SetChannelVoltageRange(hadc->Instance, sConfigChannel->Channel, sConfigChannel->VoltRange);
    }
  }
  /* If a conversion is on going no update could be done on                   */
  /* neither of the channel configuration structure parameters.               */
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

    tmp_hal_status = HAL_ERROR;
  }

  if (sConfigChannel->CalibrationPoint.Number != ADC_CALIB_NONE)
  {
    if (sConfigChannel->CalibrationPoint.Gain != 0UL)
    {
      tmp_gain = sConfigChannel->CalibrationPoint.Gain;
    }
    else if ((sConfigChannel->VoltRange == ADC_VIN_RANGE_1V2)
             || (sConfigChannel->Channel == ADC_CHANNEL_TEMPSENSOR))
    {
      /* 1.2V mode: [calibrated gain = 0.96, gain clamped at 1] */
      tmp_gain = 0xFFFUL;
    }
    else if (sConfigChannel->VoltRange == ADC_VIN_RANGE_2V4)
    {
      /* 2.4V mode: [calibrated gain = 1/2] */
      tmp_gain = 0x7FFUL;
    }
    else /* ADC_VIN_RANGE_3V6 */
    {
      /* 3.6V mode: [calibrated gain = 1/3] */
      tmp_gain = 0x555UL;
    }
    LL_ADC_ConfigureCalibPoint(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                               tmp_gain, sConfigChannel->CalibrationPoint.Offset);

    switch (sConfigChannel->Channel)
    {
      case ADC_CHANNEL_VINM0:
      case ADC_CHANNEL_VINM1:
      case ADC_CHANNEL_VINM2:
      case ADC_CHANNEL_VINM3:
      {
        LL_ADC_SetCalibPointForSingleNeg(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         sConfigChannel->VoltRange);
        break;
      }
      case ADC_CHANNEL_VINP0:
      case ADC_CHANNEL_VINP1:
      case ADC_CHANNEL_VINP2:
      case ADC_CHANNEL_VINP3:
      {
        LL_ADC_SetCalibPointForSinglePos(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         sConfigChannel->VoltRange);
        break;
      }
      case ADC_CHANNEL_VINP0_VINM0:
      case ADC_CHANNEL_VINP1_VINM1:
      case ADC_CHANNEL_VINP2_VINM2:
      case ADC_CHANNEL_VINP3_VINM3:
      {
        LL_ADC_SetCalibPointForDiff(hadc->Instance, sConfigChannel->CalibrationPoint.Number, sConfigChannel->VoltRange);
        break;
      }
      case ADC_CHANNEL_VBAT:
      {
        LL_ADC_SetCalibPointForSingleNeg(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         LL_ADC_VIN_RANGE_3V6);
        break;
      }
      case ADC_CHANNEL_TEMPSENSOR:
      {
        LL_ADC_SetCalibPointForSinglePos(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         LL_ADC_VIN_RANGE_1V2);
        break;
      }
      default:
      {
        /* Update ADC state machine to error */
        SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

