stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_adc.c
        tmp_hal_status = HAL_ERROR;
        break;
      }
    }
  }
  else
  {
    /* Nothing to do */
    __NOP();
  }

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}


/**
  * @brief  Configure the watchdog.
  * @note   Possibility to update parameters on the fly:
  *         This function initializes the watchdog, successive
  *         calls to this function can be used to reconfigure some parameters
  *         of structure "ADC_AnalogWDGConfTypeDef" on the fly, without
  *         resetting the ADC.
  *         The setting of these parameters is conditioned to ADC state.
  * @param hadc ADC handle
  * @param ConfigWatchdog Structure of ADC watchdog configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_AnalogWDGConfig(ADC_HandleTypeDef *hadc, const ADC_AnalogWDGConfTypeDef *ConfigWatchdog)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_AWD_CHANNEL(ConfigWatchdog->ChannelMask));
  assert_param(IS_ADC_AWD_EVENT_TYPE(ConfigWatchdog->EventType));

  /* Process locked */
  __HAL_LOCK(hadc);

  /* Check if there is a conversion on going */
  if (LL_ADC_IsConversionOngoing(hadc->Instance) == 0UL)
  {
    /* Configure the thresholds */
    LL_ADC_ConfigureAWDThresholds(hadc->Instance, ConfigWatchdog->LowThreshold, ConfigWatchdog->HighThreshold);

    /* Set the channels mask */
    LL_ADC_SetAWDInputChannels(hadc->Instance, ConfigWatchdog->ChannelMask);

    /* Update state, clear previous result related to watchdog */
    CLEAR_BIT(hadc->State, HAL_ADC_STATE_AWD1);

    /* Clear flag ADC analog watchdog */
    /* Note: Flag cleared Clear the ADC Analog watchdog flag to be ready  */
    /* to use for HAL_ADC_IRQHandler() or HAL_ADC_PollForEvent()          */
    /* (in case left enabled by previous ADC operations).                 */
    LL_ADC_ClearFlag_AWD(hadc->Instance);

    /* Configure ADC analog watchdog interrupt */
    if (ConfigWatchdog->EventType == ADC_AWD_EVENT_INTERRUPT)
    {
      LL_ADC_EnableIT_AWD(hadc->Instance);
    }
    else
    {
      LL_ADC_DisableIT_AWD(hadc->Instance);
    }
  }
  /* If a conversion is on going , no update could be done */
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

    tmp_hal_status = HAL_ERROR;
  }
  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

#if defined(ADC_SUPPORT_AUDIO_FEATURES)
/**
  * @brief Configure the decimation filter
  *
  * @param hadc ADC handle
  * @param ConfigDF Structure of decimation filter configuration
  * @return status HAL
  */
HAL_StatusTypeDef HAL_ADC_DFConfig(ADC_HandleTypeDef *hadc, const ADC_DFConfTypeDef *ConfigDF)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_DF_DYNAMIC_RANGE(ConfigDF->DynamicMode));
  assert_param(IS_FUNCTIONAL_STATE(ConfigDF->HighPassFilter));
  assert_param(IS_ADC_DF_DATA_FORMAT(ConfigDF->OutputDataFormatMode));
  assert_param(IS_ADC_DF_DATA_FORMAT(ConfigDF->InputDataFormatMode));
  assert_param(IS_FUNCTIONAL_STATE(ConfigDF->FractionalInterpolator));
  assert_param(IS_ADC_DF_CIC_DECIMATOR_HALF_FACTOR(ConfigDF->CICFilterDecimatorHalfFactor));
  assert_param(IS_ADC_DF_CIC_DECIMATOR_FACTOR(ConfigDF->MCICOutputFrequency));

  /* Process locked */
  __HAL_LOCK(hadc);

  LL_ADC_SetDFInputDynamic(hadc->Instance, ConfigDF->DynamicMode);
  if (ConfigDF->HighPassFilter == ENABLE)
  {
    LL_ADC_DFHighPassFilterEnable(hadc->Instance);
  }
  else
  {
    LL_ADC_DFHighPassFilterDisable(hadc->Instance);
  }

  LL_ADC_SetDataOutputFormat(hadc->Instance, ConfigDF->OutputDataFormatMode);
  LL_ADC_SetDataInputFormat(hadc->Instance, ConfigDF->InputDataFormatMode);
  if (ConfigDF->FractionalInterpolator == ENABLE)
  {
    LL_ADC_FractionalInterpolatorEnable(hadc->Instance);
  }
  else
  {
    LL_ADC_FractionalInterpolatorDisable(hadc->Instance);
  }
  LL_ADC_SetCICDecimatorFactor(hadc->Instance, ConfigDF->CICFilterDecimatorHalfFactor);
  LL_ADC_SetMicrophoneOutputDatarate(hadc->Instance, ConfigDF->MCICOutputFrequency);

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

#endif /* ADC_SUPPORT_AUDIO_FEATURES */
/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group7 Peripheral State functions
  * @brief    ADC Peripheral State functions
  *
@verbatim
 ===============================================================================
            ##### Peripheral state and errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions to get in run-time the status of the
    peripheral.
      (+) Check the ADC state
      (+) Check the ADC error code

@endverbatim
  * @{
  */

/**
  * @brief  Return the ADC handle state.
  * @note   ADC state machine is managed by bitfields, ADC status must be
  *         compared with states bits.
  *         For example:
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_DS_BUSY) != 0UL) "
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_AWD1) != 0UL) "
  * @param hadc ADC handle
  * @retval ADC handle state (bitfield on 32 bits)
  */
uint32_t HAL_ADC_GetState(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Return ADC handle state */
  return hadc->State;
}

/**
  * @brief  Return the ADC error code.
  * @param hadc ADC handle
  * @retval ADC error code (bitfield on 32 bits)
  */
uint32_t HAL_ADC_GetError(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  return hadc->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Functions ADC Private Functions
  * @{
  */

/**
  * @brief Stop ADC conversion.
  * @param hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef ADC_ConversionStop(ADC_HandleTypeDef *hadc)
{
  uint32_t is_conversion_on;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Verification if ADC is not already stopped to bypass this function if    */
  /* not needed.                                                              */
  is_conversion_on = LL_ADC_IsConversionOngoing(hadc->Instance);
  if (is_conversion_on != 0UL)
  {
    /* Stop ADC conversion */
    LL_ADC_StopConversion(hadc->Instance);
  }

  /* Return HAL status */
  return HAL_OK;
}


/**
  * @brief  Enable the selected ADC.
  * @note   Prerequisite condition to use this function: ADC must be disabled
  *         and voltage regulator must be enabled (done into HAL_ADC_Init()).
  * @param hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef ADC_Enable(ADC_HandleTypeDef *hadc)
{
  /* ADC enable  */
  if (LL_ADC_IsEnabled(hadc->Instance) == 0UL)
  {
    /* Enable the ADC peripheral */
    LL_ADC_Enable(hadc->Instance);
  }

  /* Return HAL status */
  return HAL_OK;
}


/**
  * @brief  Disable the selected ADC.
  * @note   Prerequisite condition to use this function: ADC conversions must be
  *         stopped.
  * @param hadc ADC handle
  * @retval HAL status.
  */
HAL_StatusTypeDef ADC_Disable(ADC_HandleTypeDef *hadc)
{
  /* Verification if ADC is not already disabled: */
  if ((LL_ADC_IsEnabled(hadc->Instance) != 0UL))
  {
    /* Disable the ADC peripheral */
    LL_ADC_Disable(hadc->Instance);
  }

  /* Return HAL status */
  return HAL_OK;
}

/**
  * @brief  DMA transfer complete callback.
  * @param hdma pointer to DMA handle.
  * @retval None
  */
void ADC_DMAConvCplt(DMA_HandleTypeDef *hdma)
{
  /* Retrieve ADC handle corresponding to current DMA handle */
  ADC_HandleTypeDef *hadc = (ADC_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

